In [5]:
import numpy as np
import pandas as pd

In [9]:
data1 = {'Nama':['adam','michael','jacobs','Ujang','felicia','joseph'],
'Kelas':[4,4,3,5,6,2],
'Jenis Kelamin':['Pria','Pria','Pria','Pria','Wanita','Wanita']}

In [10]:
DATA1 =pd.DataFrame(data1)

In [2]:
data2 = {'Nama':['adam','michael','jacobs','bambang','felicia','wati'],
'Nilai Tugas':[98,67,30,55,90,76],
'Nilai Ujian':[50,70,99,86,49,66]}

In [6]:
DATA2= pd.DataFrame(data2)

In [11]:
pd.merge(DATA1,DATA2,on='Nama')

      Nama  Kelas Jenis Kelamin  Nilai Tugas  Nilai Ujian
0     adam      4          Pria           98           50
1  michael      4          Pria           67           70
2   jacobs      3          Pria           30           99
3  felicia      6        Wanita           90           49

In [20]:
pd.merge(DATA1,DATA2,how='outer',on='Nama')

      Nama  Kelas Jenis Kelamin  Nilai Tugas  Nilai Ujian
0     adam    4.0          Pria         98.0         50.0
1  michael    4.0          Pria         67.0         70.0
2   jacobs    3.0          Pria         30.0         99.0
3    Ujang    5.0          Pria          NaN          NaN
4  felicia    6.0        Wanita         90.0         49.0
5   joseph    2.0        Wanita          NaN          NaN
6  bambang    NaN           NaN         55.0         86.0
7     wati    NaN           NaN         76.0         66.0

In [21]:
pd.merge(DATA1,DATA2,how='right',on='Nama')

      Nama  Kelas Jenis Kelamin  Nilai Tugas  Nilai Ujian
0     adam    4.0          Pria           98           50
1  michael    4.0          Pria           67           70
2   jacobs    3.0          Pria           30           99
3  bambang    NaN           NaN           55           86
4  felicia    6.0        Wanita           90           49
5     wati    NaN           NaN           76           66

In [22]:
pd.merge(DATA1,DATA2,how='left',on='Nama')

      Nama  Kelas Jenis Kelamin  Nilai Tugas  Nilai Ujian
0     adam      4          Pria         98.0         50.0
1  michael      4          Pria         67.0         70.0
2   jacobs      3          Pria         30.0         99.0
3    Ujang      5          Pria          NaN          NaN
4  felicia      6        Wanita         90.0         49.0
5   joseph      2        Wanita          NaN          NaN

In [23]:
DATA1

      Nama  Kelas Jenis Kelamin
0     adam      4          Pria
1  michael      4          Pria
2   jacobs      3          Pria
3    Ujang      5          Pria
4  felicia      6        Wanita
5   joseph      2        Wanita

In [18]:
DATA2

      Nama  Nilai Tugas  Nilai Ujian
0     adam           98           50
1  michael           67           70
2   jacobs           30           99
3  bambang           55           86
4  felicia           90           49
5     wati           76           66

In [31]:
DATA1A= pd.DataFrame(DATA1['Jenis Kelamin'])

In [32]:
DATA2A = pd.DataFrame(DATA2['Nilai Ujian'])

In [34]:
DATA1A.join(DATA2A)

  Jenis Kelamin  Nilai Ujian
0          Pria           50
1          Pria           70
2          Pria           99
3          Pria           86
4        Wanita           49
5        Wanita           66

In [36]:
data3 = {'Nama':['A','B','C','D','E','F'],
'Kelas':[1,2,1,5,6,6],
'Jenis Kelamin':['Pria','Wanita','Pria','Wanita','Wanita','Wanita'],
'Nilai Tugas':[60,60,30,55,50,76],
'Nilai Ujian':[56,78,67,54,57,57]}

In [37]:
DATA3 = pd.DataFrame(data3)

In [38]:
pd.concat([DATA1,DATA2,DATA3])

      Nama  Kelas Jenis Kelamin  Nilai Tugas  Nilai Ujian
0     adam    4.0          Pria          NaN          NaN
1  michael    4.0          Pria          NaN          NaN
2   jacobs    3.0          Pria          NaN          NaN
3    Ujang    5.0          Pria          NaN          NaN
4  felicia    6.0        Wanita          NaN          NaN
5   joseph    2.0        Wanita          NaN          NaN
0     adam    NaN           NaN         98.0         50.0
1  michael    NaN           NaN         67.0         70.0
2   jacobs    NaN           NaN         30.0         99.0
3  bambang    NaN           NaN         55.0         86.0
4  felicia    NaN           NaN         90.0         49.0
5     wati    NaN           NaN         76.0         66.0
0        A    1.0          Pria         60.0         56.0
1        B    2.0        Wanita         60.0         78.0
2        C    1.0          Pria         30.0         67.0
3        D    5.0        Wanita         55.0         54.0
4        E    6.0        Wanita         50.0         57.0
5        F    6.0        Wanita         76.0         57.0

In [39]:
pd.concat([DATA1,DATA2,DATA3],axis=1)

,Nama,Kelas,Jenis Kelamin,Nama,Nilai Tugas,Nilai Ujian,Nama,Kelas,Jenis Kelamin,Nilai Tugas,Nilai Ujian
0,adam,4,Pria,adam,98,50,A,1,Pria,60,56
1,michael,4,Pria,michael,67,70,B,2,Wanita,60,78
2,jacobs,3,Pria,jacobs,30,99,C,1,Pria,30,67
3,Ujang,5,Pria,bambang,55,86,D,5,Wanita,55,54
4,felicia,6,Wanita,felicia,90,49,E,6,Wanita,50,57
5,joseph,2,Wanita,wati,76,66,F,6,Wanita,76,57